---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.RebarUpdateService
source: html/a89644f0-3624-d4e5-fbb6-4f5525d7efee.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.RebarUpdateService Property

Autodesk Internal: The service for updating rebar freeform elements

## Syntax (C#)
```csharp
public static ExternalServiceId RebarUpdateService { get; }
```